In [7]:
import pandas as pd
print("Done")

Done

In [8]:
MAIN_DATA = pd.read_csv("/content/train(2).csv")

In [9]:
df = MAIN_DATA[["Name", "Age", "Sex"]].copy()

In [10]:
df

                                                  Name   Age     Sex
0                              Braund, Mr. Owen Harris  22.0    male
1    Cumings, Mrs. John Bradley (Florence Briggs Th...  38.0  female
2                               Heikkinen, Miss. Laina  26.0  female
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)  35.0  female
4                             Allen, Mr. William Henry  35.0    male
..                                                 ...   ...     ...
886                              Montvila, Rev. Juozas  27.0    male
887                       Graham, Miss. Margaret Edith  19.0  female
888           Johnston, Miss. Catherine Helen "Carrie"   NaN  female
889                              Behr, Mr. Karl Howell  26.0    male
890                                Dooley, Mr. Patrick  32.0    male

[891 rows x 3 columns]

In [11]:
#katastrofa - 1912
katastrofa = 1912
df["Rok urodzenia"] = [katastrofa - wiek for wiek in df["Age"]]

In [ ]:
df

In [ ]:
df["Sex"].value_counts()

Funkcje

In [ ]:
#Funkcja i metoda?

#Metoda zawsze jest uzależniona od obiektu na ktorym działamy 
#.metoda

#Funkcje nie są uzaleznione od obiektu
#funkcja()

In [17]:
def drukarka():
  print("To jest strona testowa")

In [18]:
drukarka()

To jest strona testowa

In [31]:
def dodawanie(liczba1, liczba2):
  wynik = liczba1 + liczba2
  return wynik

In [48]:
tekst = "PAtr$Yk JEST Z!aSpAnY      "

In [45]:
tekst_czysty = tekst.lower().replace("$", "").replace("!", "").strip().capitalize()

In [46]:
tekst_czysty

'Patryk jest zaspany'

In [47]:
def clean_text(tekst):
  tekst_czysty = tekst.lower().replace("$", "").replace("!", "").strip().capitalize() 
  return tekst_czysty

In [49]:
tekst

'PAtr$Yk JEST Z!aSpAnY      '

In [50]:
tekst_czysty = clean_text(tekst)

In [51]:
tekst_czysty

'Patryk jest zaspany'

In [52]:
tekst2 = "A!La M$a KOTA    "

In [53]:
tekst2_czysty = clean_text(tekst2)

In [54]:
tekst2_czysty

'Ala ma kota'

In [55]:
df_oceny = pd.DataFrame({"Nazwisko i imię: " : ["Hubar, Patryk", "Nowak, Jan", "Kowalski, Andrzej"], "Punkty" : [15, 12, 1]})

In [57]:
df_oceny

   Nazwisko i imię:   Punkty
0      Hubar, Patryk      15
1         Nowak, Jan      12
2  Kowalski, Andrzej       1

In [58]:
def jaka_ocena(punkty):
  if punkty >= 15:
    return "Bardzo dobry"
  elif punkty < 15 and punkty >= 8:
    return "Dobry"
  else:
    return "Niedostateczny"

In [ ]:
jaka_ocena(1)

In [65]:
#Apply

df_oceny["Ocena"] = df_oceny["Punkty"].apply(jaka_ocena)

In [63]:
df_oceny

   Nazwisko i imię:   Punkty           Ocena
0      Hubar, Patryk      15    Bardzo dobry
1         Nowak, Jan      12           Dobry
2  Kowalski, Andrzej       1  Niedostateczny